/* 
    Немного теории о тайминговых атаках
    Тайминговые атаки — это метод, при котором злоумышленник пытается угадать пароль, основываясь на времени, 
    затрачиваемом на проверку каждого пароля. Для защиты от таких атак можно применять следующие подходы:

        1. Использование одинакового времени обработки:
            Ваша проверка пароля должна занимать фиксированное время, независимо от того, был ли угадан пароль или нет. 
            Это можно реализовать, добавляя задержку после проверки.

        2. Сравнение хешей безопасным способом:
            Используйте безопасные методы сравнения строк, такие как crypto.timingSafeEqual в Node.js, 
            которые минимизируют разницу во времени при сравнении.

        3. Дополнительные меры безопасности:
            Добавляйте задержку после неудачных попыток аутентификации, чтобы затруднить угадание пароля через 
            тайминговые атаки. Увеличивайте сложность хеширования (например, используя bcrypt с 
            достаточным количеством итераций), что увеличивает время обработки, но не зависит от входных данных.
*/

